000100250518     A                                      UNIQUE
000101250518     A          R ADDRESSR
000102250518     A            ADR_ID         5A         TEXT('住所ID')
000103250518     A            CUST_ID        5A         TEXT('顧客ID')
000104250518     A            ZIP_CD         8S 0       TEXT('郵便番号')
000105250518     A            ADR          100O         TEXT('住所')
000107250518     A          K ADR_ID
