000100250515     A                                      DSPSIZ(24 80 *DS3)
000101250515     A                                      INDARA
000102250515     A          R LOGINR
000103250515     A*                                      OVERLAY
000104250515     A                                      CF03(03)
000105250515     A            MSG           50O  O  9 25
000106250515     A                                  5 12'ユーザ'
000107250515     A            UID           10A  B  5 25
000108250515     A                                  7 12'パスワード'
000109250515     A            PWD           20A  B  7 25DSPATR(ND)
000111250515     A                                      COLOR(WHT) DSPATR(HI)
000112250515     A                                 12  2'F3= Exit'
