000117250518     A                                      DSPSIZ(24 80 *DS3)
000118250515     A                                      INDARA
000119250518     A*------------------------------------------------------------------
000120250518     A          R MAINR
000121250518     A                                      CF03(03)
000122250601     A                                  1  2USER
000123250601     A                                      COLOR(BLU)
000124250601     A                                  1 63TIME
000125250601     A                                      COLOR(BLU)
000126250601     A                                  1 72DATE
000127250601     A                                      EDTCDE(Y)
000128250601     A                                      COLOR(BLU)
000129250601     A            MSCREEN       20A  O  2  2COLOR(BLU)
000130250601     A                                  2 72SYSNAME
000131250601     A                                      COLOR(BLU)
000132250518     A            IN1            1A  B  5 10
000133250604     A                                  5 13'CUSTOMER 顧客テーブル'
000134250604     A*            IN2            1A  B  6 10
000135250604     A*                                  6 13'ADDRESS 住所テーブル'
000136250604     A*            IN3            1A  B  7 10
000137250604     A*                                  7 13'ORDER 受注履歴テーブル'
000138250521     A            MSG           50O  O 18 10
000139250518     A                                 22  2'F3= Exit'
000140250601     A                                      COLOR(BLU)
000141250521     A                                 23  2'1=検索 2=登録'
000142250601     A                                      COLOR(BLU)
000154250517     A*------------------------------------------------------------------
000182250518     A          R INSERTR1
000183250515     A*                                      OVERLAY
000184250518     A                                      CF04(04)
000185250515     A                                      CF03(03)
000186250601     A                                  1  2USER
000187250601     A                                      COLOR(BLU)
000188250601     A                                  1 63TIME
000189250601     A                                      COLOR(BLU)
000190250601     A                                  1 72DATE
000191250601     A                                      EDTCDE(Y)
000192250601     A                                      COLOR(BLU)
000193250601     A            ISCREEN       20A  O  2  2COLOR(BLU)
000194250601     A                                  2 72SYSNAME
000195250601     A                                      COLOR(BLU)
000196250601     A                                  4  2'CUST_ID:'
000197250601     A            CUST_ID        5A  B  4 17
000198250601     A                                  5  2'NAME:'
000199250601     A            NAME          20O  B  5 17
000200250601     A                                  6  2'EMAIL:'
000201250602     A            EMAIL         30A  B  6 17
000202250601     A                                  7  2'PHONE:'
000203250601     A            PHONE         15A  B  7 17
000204250518     A            MSG           50O  O 18 10
000205250518     A*                                 23  2'F4=確定'
000206250518     A                                 22  2'F3= Exit'
000207250601     A                                      COLOR(BLU)
