000100250601     A          R UPDATED1R
000101250601     A                                      CA04(04)
000102250601     A                                  1 30'   CUSTOMER UPDATE2   '
000103250601     A                                  3 10'CUST_ID :'
000104250601     A            U_CUSTID       5A  B  3 20
000105250601     A*                                       DSPATR(PR)
000106250601     A                                  4 10'NAME    :'
000107250601     A            U_NAME        20O  B  4 20
000108250601     A                                  5 10'EMAIL   :'
000109250601     A            U_EMAIL       50A  B  5 20
000110250601     A                                  6 10'PHONE   :'
000111250601     A            U_PHONE       15A  B  6 20
000112250601     A            MSG           40A  O  8 15
000113250601     A                                 22  2'F3=Exit  F4=Update'
