000100251015     A          R USRACR
000101251015     A            ID            10A         TEXT('ID')
000102251015     A            PWD           20A         TEXT('パスワード')
000103251015     A            ACTIVE         1S 0       TEXT('活性')
000104251015     A            NOTES         20O         TEXT('備考')
000105251015     A          K ID
000106251015     A          K PWD
000107251015
