000100251015     A                                      DSPSIZ(24 80 *DS3)
000101251015     A                                      INDARA
000102251015     A          R LOGINR
000103251015     A*                                      OVERLAY
000104251015     A                                      CF03(03)
000105251015     A            MSG           50O  O  9 25
000106251015     A                                  5 12'ユーザ'
000107251015     A            UID           10A  B  5 25
000108251015     A                                  7 12'パスワード'
000109251015     A            PWD           20A  B  7 25DSPATR(ND)
000110251015     A                                      COLOR(WHT) DSPATR(HI)
000111251015     A                                 12  2'F3= EXIT'
000112251015
