000100251015     A                                      DSPSIZ(24 80 *DS3)
000101251015     A                                      INDARA
000102251015     A*------------------------------------------------------------------
000103251015     A          R MAINR
000104251015     A                                      CF03(03)
000105251015     A                                  1  2USER
000106251015     A                                      COLOR(BLU)
000107251015     A                                  1 63TIME
000108251015     A                                      COLOR(BLU)
000109251015     A                                  1 72DATE
000110251015     A                                      EDTCDE(Y)
000111251015     A                                      COLOR(BLU)
000112251015     A            MSCREN        20A  O  2  2COLOR(BLU)
000113251015     A                                  2 72SYSNAME
000114251015     A                                      COLOR(BLU)
000115251015     A            IN1            1A  B  5 10
000116251015     A                                  5 13'CUSTOMER顧客テーブル'
000117251015     A*            IN2            1A  B  6 10
000118251015     A*                                  6 13'ADDRESS住所テーブル'
000119251015     A*            IN3            1A  B  7 10
000120251015     A*                                  7 13'ORDER注履歴テーブル'
000121251015     A            MSG           50O  O 18 10
000122251015     A                                 22  2'F3= EXIT'
000123251015     A                                      COLOR(BLU)
000124251015     A                                 23  2'1=検索 2=登録'
000125251015     A                                      COLOR(BLU)
000126251015     A*------------------------------------------------------------------
000127251015     A          R INSRT
000128251015     A*                                      OVERLAY
000129251015     A                                      CF04(04)
000130251015     A                                      CF03(03)
000131251015     A                                  1  2USER
000132251015     A                                      COLOR(BLU)
000133251015     A                                  1 63TIME
000134251015     A                                      COLOR(BLU)
000135251015     A                                  1 72DATE
000136251015     A                                      EDTCDE(Y)
000137251015     A                                      COLOR(BLU)
000138251015     A            ISCR          20A  O  2  2COLOR(BLU)
000139251015     A                                  2 72SYSNAME
000140251015     A                                      COLOR(BLU)
000141251015     A                                  4  2'CUST_ID:'
000142251015     A            CUSTID         5A  B  4 17
000143251015     A                                  5  2'NAME:'
000144251015     A            NAME          20O  B  5 17
000145251015     A                                  6  2'EMAIL:'
000146251015     A            EMAIL         30A  B  6 17
000147251015     A                                  7  2'PHONE:'
000148251015     A            PHONE         15A  B  7 17
000149251015     A            MSG           50O  O 18 10
000150251015     A                                 23  2'F4=確定'
000151251015     A                                 22  2'F3= EXIT'
000152251015     A                                      COLOR(BLU)
000153251015
