000100250617     F*--------------------------------------------------------定義関連
000101250617     FBJT01FM CF  E                    WORKSTN
000102250617     E                    #MSG    1  11 78
000103250617     IVALUE       DS                          1  20
000104250617     I                                       19  20 VAMOJI
000105250617     I                                       19  200VAKAZU
000106250617     C           PLIST1    PLIST
000107250617     C                     PARM           VALUE  20
000108250617     C*
000109250617     C* -------------------------------------------------------初期化------ 7
000110250617     C*
000111250617     C                     SETOF                     KC    F3キー
000112250617     C                     SETOF                     KE    F5キー
000113250617     C                     SETOF                     90    PGM終了
000114250617     C                     SETOF                     91    タイトル戻る
000115250617     C                     SETOF                     92     判定開始
000116250617     C                     SETOF                     93     判定押下可
000117250617     C                     SETOF                     94    除外用フラッ
000118250617     C                     SETOF                     95     RDリセット
000119250617     C                     SETOF                     99    乱数ループ
000120250617     C*
000121250617     C                     MOVEL*BLANK    EIMOJI  2
000122250617     C                     Z-ADD*ZERO     YOUCRD  20
000123250617     C                     Z-ADD*ZERO     DLRCRD  20
000124250617     C                     MOVEL*BLANK    D01BOX  4
000125250617     C                     Z-ADD*ZERO     ACEBOX  20
000126250617     C                     Z-ADD*ZERO     ACEBX2  20
000127250617     C                     Z-ADD*ZERO     DCEBOX  20
000128250617     C                     Z-ADD*ZERO     DCEBX2  20
000129250617     C                     MOVEL*BLANK    RESULT
000130250617     C                     MOVEL*BLANK    XXP01
000131250617     C                     MOVEL*BLANK    XXD01
000132250617     C                     Z-ADD*ZERO     HITCNT  20
000133250617     C                     Z-ADD*ZERO     HITCT2  20
000134250617     C                     Z-ADD*ZERO     YOUPT   10
000135250617     C                     Z-ADD*ZERO     DLRPT   10
000136250617     C*---------------------------------------------------------本編開始---
000137250617     C*
000138250627D‾‾‾‾C           DLRPT     DOWEQ'0'
000139250617     C                     SETOF                     KC
000140250617     C                     SETOF                     KE
000141250617     C                     SETOF                     91
000142250617     C                     SETOF                     99
000143250617     C*
000144250617     C                     WRITEDSP00
000145250617     C                     EXFMTDSP01                      タイトル画面
000146250617     C*
000147250617      *
000148250617     C*
000149250617 I---C           *INKC     IFEQ '1'
000150250617     C                     SETON                     90
000151250617     C                     LEAVE
000152250617 E---C                     ENDIF
000153250617     C*
000154250617 I---C           *INKE     IFEQ '1'
000155250617     C                     WRITEDSP00
000156250617     C                     EXFMTDSP02                      遊び方説明
000157250617     C*
000158250617  I--C           *INKC     IFEQ '1'
000159250617     C                     SETON                     90
000160250617     C                     LEAVE
000161250617  E--C                     ENDIF
000162250617     C*
000163250617     C                     ITER
000164250617 E---C                     ENDIF
000165250617     C*
000166250617     C                     MOVEL#MSG,1    MSG01
000167250617     C                     Z-ADD*ZERO     YOUPT
000168250617     C                     Z-ADD*ZERO     DLRPT
000169250617     C                     EXSR STRADD
000170250617     C*
000171250617     C                     EXSR BRDRST
000172250617 D‾‾‾C           *IN91     DOWEQ'0'
000173250617     C                     SETOF                     99
000174250617     C                     WRITEDSP00
000175250617     C                     WRITEDSP99
000176250617     C                     EXFMTDSP03                      プレイ画面表示
000177250617     C*
000178250617  I--C           YOUPT     IFEQ 3
000179250617     C           DLRPT     OREQ 3
000180250617     C                     EXSR GAMEST
000181250617     C                     SETON                     91
000182250617     C                     LEAVE
000183250617  E--C                     ENDIF
000184250617     C*
000185250617  I--C           *IN95     IFEQ '1'
000186250617     C                     SETOF                     95
000187250617     C                     EXSR BRDRST
000188250617     C*                    MOVELYOUCRD    HHHHHH
000189250617     C*                    MOVELDLRCRD    HHHHH2
000190250617     C                     ITER
000191250617  E--C                     ENDIF
000192250617     C*
000193250617  I--C           *INKC     IFEQ '1'
000194250617     C                     SETON                     91
000195250617     C                     LEAVE
000196250617  E--C                     ENDIF
000197250617     C*
000198250617  I--C           HITCT2    IFEQ 0
000199250617   D‾C           HITCT2    DOWLE1
000200250617     C                     SETOF                     99
000201250617     C                     EXSR DLRSET
000202250617   E_C                     ENDDO
000203250617     C                     ITER
000204250617  E--C                     ENDIF
000205250617     C*
000206250617  I--C           *IN92     IFEQ '0'
000207250617   I-C           HITCNT    IFGE 2
000208250617     C                     SETON                     93
000209250617   E-C                     ENDIF
000210250617  E--C                     ENDIF
000211250617     C*
000212250617  I--C           *IN93     IFEQ '1'
000213250617   I-C           *INKH     IFEQ '1'
000214250617     C           LP01      TAG
000215250617     C                     MOVELD01BOX    XXD01
000216250617     C                     MOVEL#MSG,9    MSG01
000217250617     C                     SETON                     92
000218250617     C                     SETOF                     93
000219250617     C                     ITER
000220250617   E-C                     ENDIF
000221250617  E--C                     ENDIF
000222250617     C*
000223250617  I--C           *IN92     IFEQ '1'
000224250617     C*
000225250617   I-C           YOUCRD    IFLE 11
000226250617     C           ACEBOX    ANDNE0
000227250617     C                     ADD  10        YOUCRD
000228250617   E-C                     ENDIF
000229250617     C*             ---ジャスト21狙い-----ディーラー精算エース差分の処理
000230250617   I-C           DLRCRD    IFLE 20
000231250617     C                     Z-ADDDCEBOX    DCEBX2
000232250617    DC           DCEBX2    DOWNE0
000233250617     C                     ADD  10        DLRCRD
000234250617I====C           DLRCRD    IFEQ 21
000235250617     C                     GOTO LP2
000236250617E====C                     ENDIF
000237250617     C                     ADD  -10       DCEBX2
000238250617    EC                     ENDDO
000239250617     C                     SUB  DCEBOX    DLRCRD
000240250617   E-C                     ENDIF
000241250617     C           LP2       TAG
000242250617     C*           ------------------------
000243250617   I-C           DLRCRD    IFGE 21
000244250617     C                     EXSR JJJ1
000245250617     C                     ITER
000246250617   E-C                     ENDIF
000247250617     C*
000248250617   I-C           DLRCRD    IFLE 20
000249250617    IC           DLRCRD    IFLE 16
000250250617     C                     EXSR DLRFX2
000251250617     C                     ITER
000252250617    EC                     ENDIF
000253250617    IC           DLRCRD    IFEQ 17
000254250617I====C           DCEBOX    IFNE 0
000255250617     C                     EXSR DLRFX2
000256250617     C                     ITER
000257250617E====C                     ENDIF
000258250617    EC                     ENDIF
000259250617     C                     EXSR JJJ1
000260250617     C                     ITER
000261250617   E-C                     ENDIF
000262250617  E--C                     ENDIF
000263250617     C*
000264250617  D‾‾C           *IN99     DOWEQ'0'
000265250617     C                     CALL 'BJT02C'  PLIST1           時間スタンプ
000266250617   I-C           VAKAZU    IFGE 13
000267250617     C                     ITER
000268250617   +-C                     ELSE
000269250617     C                     EXSR MAX4
000270250617    IC           *IN94     IFEQ '1'
000271250617     C                     ITER
000272250617    +C                     ELSE
000273250617     C*                                          画面にセット
000274250617I====C           VAKAZU    IFGE 2
000275250617     C           VAKAZU    ANDLE10
000276250617     C           XXP01     CAT  VAMOJI:2  XXP01
000277250617+====C                     ELSE
000278250617 I===C           VAKAZU    IFEQ 1
000279250617     C                     MOVEL' A'      EIMOJI
000280250617 E===C                     ENDIF
000281250617 I===C           VAKAZU    IFEQ 11
000282250617     C                     MOVEL' J'      EIMOJI
000283250617 E===C                     ENDIF
000284250617 I===C           VAKAZU    IFEQ 12
000285250617     C                     MOVEL' Q'      EIMOJI
000286250617 E===C                     ENDIF
000287250617 I===C           VAKAZU    IFEQ 0
000288250617     C                     MOVEL' K'      EIMOJI
000289250617 E===C                     ENDIF
000290250617     C           XXP01     CAT  EIMOJI:2  XXP01
000291250617E====C                     ENDIF
000292250617    EC                     ENDIF
000293250617   E-C                     ENDIF
000294250617     C*
000295250617     C                     SETON                     99
000296250617  E__C                     ENDDO
000297250617     C*                                           カード引きすぎアウト処理---
000298250617     C                     ADD  1         HITCNT
000299250617  I--C           HITCNT    IFEQ 11
000300250617     C                     WRITEDSP90
000301250617     C                     EXFMTDSP90
000302250617     C                     SETON                     91
000303250617     C                     LEAVE
000304250617  E--C                     ENDIF
000305250617     C*
000306250617     C*
000307250617     C*                                            持ち札カウント
000308250617  I--C           VAKAZU    IFGE 2
000309250617     C           VAKAZU    ANDLE10
000310250617     C                     ADD  VAKAZU    YOUCRD
000311250617  E--C                     ENDIF
000312250617  I--C           VAKAZU    IFEQ 0
000313250617     C           VAKAZU    ORGE 11
000314250617     C                     ADD  10        YOUCRD
000315250617  E--C                     ENDIF
000316250617  I--C           VAKAZU    IFEQ 1
000317250617     C                     ADD  1         YOUCRD
000318250617     C                     ADD  10        ACEBOX
000319250617  E--C                     ENDIF
000320250617  I--C           YOUCRD    IFEQ 21
000321250617     C*               ジャスト２１処理
000322250617     C                     WRITEDSP00
000323250617     C                     WRITEDSP99
000324250617     C                     EXFMTDSP03                      プレイ画面表示
000325250617     C                     GOTO LP01
000326250617  E--C                     ENDIF
000327250617  I--C           YOUCRD    IFGE 22
000328250617     C                     MOVEL#MSG,3    MSG01
000329250617     C                     MOVEL#MSG,5    RESULT
000330250617     C                     ADD  1         DLRPT
000331250617     C                     EXSR STRADD
000332250617     C                     SETON                     95
000333250617     C                     ITER
000334250617  E--C                     ENDIF
000335250617  I--C           YOUCRD    IFLE 20
000336250617     C                     Z-ADDACEBOX    ACEBX2
000337250617   D‾C           ACEBX2    DOWNE0
000338250617     C                     ADD  10        YOUCRD
000339250617    IC           YOUCRD    IFEQ 21
000340250617     C                     GOTO LP01
000341250617    EC                     ENDIF
000342250617     C                     ADD  -10       ACEBX2
000343250617   E_C                     ENDDO
000344250617     C                     SUB  ACEBOX    YOUCRD
000345250617   I-C           HITCNT    IFGE 2
000346250617     C                     MOVEL#MSG,2    MSG01
000347250617   E-C                     ENDIF
000348250617     C*                    MOVELYOUCRD    HHHHHH
000349250617  E--C                     ENDIF
000350250617     C*                    ENDIF
000351250617     C*
000352250617 E___C                     ENDDO
000353250617E____C                     ENDDO
000354250617     C                     SETON                     LR
000355250617     C                     RETRN
000356250617     C*
000357250617     C*----------------------------------------------------MAX4初期化用-------
000358250617     C*
000359250617     C*-----------------------------------------------------------------------
000360250617     C           MAX4S     BEGSR
000361250617     C                     Z-ADD*ZERO     CNT00   20
000362250617     C                     Z-ADD*ZERO     CNT01   20
000363250617     C                     Z-ADD*ZERO     CNT02   20
000364250617     C                     Z-ADD*ZERO     CNT03   20
000365250617     C                     Z-ADD*ZERO     CNT04   20
000366250617     C                     Z-ADD*ZERO     CNT05   20
000367250617     C                     Z-ADD*ZERO     CNT06   20
000368250617     C                     Z-ADD*ZERO     CNT07   20
000369250617     C                     Z-ADD*ZERO     CNT08   20
000370250617     C                     Z-ADD*ZERO     CNT09   20
000371250617     C                     Z-ADD*ZERO     CNT10   20
000372250617     C                     Z-ADD*ZERO     CNT11   20
000373250617     C                     Z-ADD*ZERO     CNT12   20
000374250617     C                     ENDSR
000375250617     C*----------------------------------------------------MAX4カウンター-----
000376250617     C*
000377250617     C*-----------------------------------------------------------------------
000378250617     C           MAX4      BEGSR
000379250617     C                     SETOF                     94    除外用フラッ
000380250617     C*
000381250617     C*                                           1ラウンドに何回出たかCT
000382250617I----C           VAKAZU    IFEQ 00
000383250617     C                     ADD  1         CNT00
000384250617 I---C           CNT00     IFGE 5
000385250617     C                     SETON                     94
000386250617 E---C                     ENDIF
000387250617E----C                     ENDIF
000388250617I----C           VAKAZU    IFEQ 01
000389250617     C                     ADD  1         CNT01
000390250617 I---C           CNT01     IFGE 5
000391250617     C                     SETON                     94
000392250617 E---C                     ENDIF
000393250617E----C                     ENDIF
000394250617I----C           VAKAZU    IFEQ 02
000395250617     C                     ADD  1         CNT02
000396250617 I---C           CNT02     IFGE 5
000397250617     C                     SETON                     94
000398250617 E---C                     ENDIF
000399250617E----C                     ENDIF
000400250617I----C           VAKAZU    IFEQ 03
000401250617     C                     ADD  1         CNT03
000402250617 I---C           CNT03     IFGE 5
000403250617     C                     SETON                     94
000404250617 E---C                     ENDIF
000405250617E----C                     ENDIF
000406250617I----C           VAKAZU    IFEQ 04
000407250617     C                     ADD  1         CNT04
000408250617 I---C           CNT04     IFGE 5
000409250617     C                     SETON                     94
000410250617 E---C                     ENDIF
000411250617E----C                     ENDIF
000412250617I----C           VAKAZU    IFEQ 05
000413250617     C                     ADD  1         CNT05
000414250617 I---C           CNT05     IFGE 5
000415250617     C                     SETON                     94
000416250617 E---C                     ENDIF
000417250617E----C                     ENDIF
000418250617I----C           VAKAZU    IFEQ 06
000419250617     C                     ADD  1         CNT06
000420250617 I---C           CNT06     IFGE 5
000421250617     C                     SETON                     94
000422250617 E---C                     ENDIF
000423250617E----C                     ENDIF
000424250617I----C           VAKAZU    IFEQ 07
000425250617     C                     ADD  1         CNT07
000426250617 I---C           CNT07     IFGE 5
000427250617     C                     SETON                     94
000428250617 E---C                     ENDIF
000429250617E----C                     ENDIF
000430250617I----C           VAKAZU    IFEQ 08
000431250617     C                     ADD  1         CNT08
000432250617 I---C           CNT08     IFGE 5
000433250617     C                     SETON                     94
000434250617 E---C                     ENDIF
000435250617E----C                     ENDIF
000436250617I----C           VAKAZU    IFEQ 09
000437250617     C                     ADD  1         CNT09
000438250617 I---C           CNT09     IFGE 5
000439250617     C                     SETON                     94
000440250617 E---C                     ENDIF
000441250617E----C                     ENDIF
000442250617I----C           VAKAZU    IFEQ 10
000443250617     C                     ADD  1         CNT10
000444250617 I---C           CNT10     IFGE 5
000445250617     C                     SETON                     94
000446250617 E---C                     ENDIF
000447250617E----C                     ENDIF
000448250617I----C           VAKAZU    IFEQ 11
000449250617     C                     ADD  1         CNT11
000450250617 I---C           CNT11     IFGE 5
000451250617     C                     SETON                     94
000452250617 E---C                     ENDIF
000453250617E----C                     ENDIF
000454250617I----C           VAKAZU    IFEQ 12
000455250617     C                     ADD  1         CNT12
000456250617 I---C           CNT12     IFGE 5
000457250617     C                     SETON                     94
000458250617 E---C                     ENDIF
000459250617E----C                     ENDIF
000460250617     C*
000461250617     C                     ENDSR
000462250617     C*
000463250617     C*---------------------------------------------勝利スターの付与　　---
000464250617     C*
000465250617     C*-----------------------------------------------------------------------
000466250617     C           STRADD    BEGSR
000467250617I----C           YOUPT     IFEQ 0
000468250617     C                     MOVEL'☆☆☆'YOUSTR
000469250617E----C                     ENDIF
000470250617I----C           YOUPT     IFEQ 1
000471250617     C                     MOVEL'★☆☆'YOUSTR
000472250617E----C                     ENDIF
000473250617I----C           YOUPT     IFEQ 2
000474250617     C                     MOVEL'★★☆'YOUSTR
000475250617E----C                     ENDIF
000476250617I----C           YOUPT     IFEQ 3
000477250617     C                     MOVEL'★★★'YOUSTR
000478250617E----C                     ENDIF
000479250617I----C           DLRPT     IFEQ 0
000480250617     C                     MOVEL'☆☆☆'DLRSTR
000481250617E----C                     ENDIF
000482250617I----C           DLRPT     IFEQ 1
000483250617     C                     MOVEL'★☆☆'DLRSTR
000484250617E----C                     ENDIF
000485250617I----C           DLRPT     IFEQ 2
000486250617     C                     MOVEL'★★☆'DLRSTR
000487250617E----C                     ENDIF
000488250617I----C           DLRPT     IFEQ 3
000489250617     C                     MOVEL'★★★'DLRSTR
000490250617E----C                     ENDIF
000491250617     C                     ENDSR
000492250617     C*---------------------------------------------ラウンド開始前初期化---
000493250617     C*
000494250617     C*-----------------------------------------------------------------------
000495250617     C           BRDRST    BEGSR
000496250617     C                     SETOF                     93
000497250617     C                     MOVEL*BLANK    RESULT
000498250617     C                     Z-ADD*ZERO     HITCNT
000499250617     C                     Z-ADD*ZERO     HITCT2
000500250617     C                     MOVEL*BLANK    XXP01
000501250617     C                     MOVEL*BLANK    XXD01
000502250617     C                     MOVEL*BLANK    D01BOX
000503250617     C                     Z-ADD*ZERO     YOUCRD
000504250617     C                     Z-ADD*ZERO     DLRCRD
000505250617     C                     Z-ADD*ZERO     ACEBOX
000506250617     C                     Z-ADD*ZERO     ACEBX2
000507250617     C                     Z-ADD*ZERO     DCEBOX
000508250617     C                     Z-ADD*ZERO     DCEBX2
000509250617     C                     EXSR MAX4S
000510250617     C                     ENDSR
000511250617     C*----------------------------------------ラウンド開始時ディーラーセット
000512250617     C*
000513250617     C*-----------------------------------------------------------------------
000514250617     C           DLRSET    BEGSR
000515250617D‾‾‾‾C           *IN99     DOWEQ'0'
000516250617     C                     CALL 'BJT02C'  PLIST1           時間スタンプ
000517250617 I---C           VAKAZU    IFGE 13
000518250617     C                     ITER
000519250617 +---C                     ELSE
000520250617     C                     EXSR MAX4
000521250617  I--C           *IN94     IFEQ '1'
000522250617     C                     ITER
000523250617  E--C                     ENDIF
000524250617 E---C                     ENDIF
000525250617     C*
000526250617 I---C           VAKAZU    IFGE 2
000527250617     C           VAKAZU    ANDLE10
000528250617     C           XXD01     CAT  VAMOJI:2  XXD01
000529250617 E---C                     ENDIF
000530250617 I---C           VAKAZU    IFEQ 1
000531250617     C                     MOVEL' A'      EIMOJI
000532250617     C           XXD01     CAT  EIMOJI:2  XXD01
000533250617 E---C                     ENDIF
000534250617 I---C           VAKAZU    IFEQ 11
000535250617     C                     MOVEL' J'      EIMOJI
000536250617     C           XXD01     CAT  EIMOJI:2  XXD01
000537250617 E---C                     ENDIF
000538250617 I---C           VAKAZU    IFEQ 12
000539250617     C                     MOVEL' Q'      EIMOJI
000540250617     C           XXD01     CAT  EIMOJI:2  XXD01
000541250617 E---C                     ENDIF
000542250617 I---C           VAKAZU    IFEQ 0
000543250617     C                     MOVEL' K'      EIMOJI
000544250617     C           XXD01     CAT  EIMOJI:2  XXD01
000545250617 E---C                     ENDIF
000546250617     C*
000547250617     C*
000548250617     C*
000549250617     C*                                            持ち札カウント
000550250617 I---C           VAKAZU    IFGE 2
000551250617     C           VAKAZU    ANDLE10
000552250617     C                     ADD  VAKAZU    DLRCRD
000553250617 E---C                     ENDIF
000554250617 I---C           VAKAZU    IFEQ 0
000555250617     C           VAKAZU    ORGE 11
000556250617     C                     ADD  10        DLRCRD
000557250617 E---C                     ENDIF
000558250617 I---C           VAKAZU    IFEQ 1
000559250617     C                     ADD  1         DLRCRD
000560250617     C                     ADD  10        DCEBOX
000561250617 E---C                     ENDIF
000562250617     C*          DLRCRD    IFEQ 21
000563250617     C*               ジャスト２１処理
000564250617     C*                    SETON                     99
000565250617     C*                    LEAVE
000566250617     C*                    ENDIF
000567250617     C*          DLRCRD    IFGE 22
000568250617     C*                    SETON                     99
000569250617     C*                    LEAVE
000570250617     C*                    ENDIF
000571250617     C*          こぴーーーーーーーーーーーーーーーーーーー
000572250617     C*          DLRCRD    IFLE 20
000573250617     C*                    Z-ADDDCEBOX    DCEBX2
000574250617     C*          ACEBX2    DOWNE0
000575250617     C*                    ADD  10        DLRCRD
000576250617     C*          DLRCRD    IFEQ 21
000577250617     C*                    SETON                     99
000578250617     C*                    LEAVE
000579250617     C*                    ENDIF
000580250617     C*                    ADD  -10       DCEBX2
000581250617     C*                    ENDDO
000582250617     C*                    SUB  DCEBOX    DLRCRD
000583250617     C*                    SETON                     99
000584250617     C*                    LEAVE
000585250617     C*                    ENDIF
000586250617     C*
000587250617     C                     ADD  1         HITCT2
000588250617     C*                    MOVELDLRCRD    HHHHH2
000589250617     C*                                           カード引きすぎアウト処理---
000590250617 I---C           HITCT2    IFEQ 11
000591250617     C                     WRITEDSP90
000592250617     C                     EXFMTDSP90
000593250617     C                     SETON                     91
000594250617     C                     SETON                     99
000595250617     C                     LEAVE
000596250617 E---C                     ENDIF
000597250617     C*                              ディーラーの一枚目なら、、、--------
000598250617 I---C           HITCT2    IFEQ 1
000599250617     C                     MOVELXXD01     D01BOX
000600250617     C                     MOVEL*BLANK    XXD01
000601250617     C                     MOVEL'   ?'    XXD01
000602250617     C                     WRITEDSP00
000603250617     C                     WRITEDSP99
000604250617     C                     EXFMTDSP03
000605250617     C*
000606250617  I--C           *INKC     IFEQ '1'
000607250617     C                     SETON                     91
000608250617     C                     LEAVE
000609250617  E--C                     ENDIF
000610250617     C*
000611250617 E---C                     ENDIF
000612250617     C*
000613250617 I---C           HITCT2    IFEQ 2
000614250617     C                     SETON                     99
000615250617     C                     LEAVE
000616250617 E---C                     ENDIF
000617250617E____C                     ENDDO
000618250617     C*
000619250617     C                     ENDSR
000620250617     C*-----------------------------------------ジャッジ前ディーラー計算１
000621250617     C*
000622250617     C*-----------------------------------------------------------------------
000623250617     C           DLRFX1    BEGSR
000624250617     C*          DLRCRD    IFEQ 21
000625250617     C*               ジャスト２１処理
000626250617     C*                    SETON                     99
000627250617     C*                    LEAVE
000628250617     C*                    ENDIF
000629250617     C*          DLRCRD    IFGE 22
000630250617     C*                    SETON                     99
000631250617     C*                    LEAVE
000632250617     C*                    ENDIF
000633250617     C*          DLRCRD    IFLE 20
000634250617     C*                    Z-ADDDCEBOX    DCEBX2
000635250617     C*          ACEBX2    DOWNE0
000636250617     C*                    ADD  10        DLRCRD
000637250617     C*          DLRCRD    IFEQ 21
000638250617     C*                    SETON                     99
000639250617     C*                    LEAVE
000640250617     C*                    ENDIF
000641250617     C*                    ADD  -10       DCEBX2
000642250617     C*                    ENDDO
000643250617     C*                    SUB  DCEBOX    DLRCRD
000644250617     C*                    SETON                     99
000645250617     C*                    LEAVE
000646250617     C*
000647250617E----C*                    ENDIF
000648250617     C                     ENDSR
000649250617     C*---------------------------------ジャッジ前ディーラー計算２（再ヒット
000650250617     C*
000651250617     C*-----------------------------------------------------------------------
000652250617     C           DLRFX2    BEGSR
000653250617     C                     SETOF                     99
000654250617D‾‾‾‾C           *IN99     DOWEQ'0'
000655250617     C                     CALL 'BJT02C'  PLIST1           時間スタンプ
000656250617 I---C           VAKAZU    IFGE 13
000657250617     C                     ITER
000658250617 +---C                     ELSE
000659250617     C                     EXSR MAX4
000660250617  I--C           *IN94     IFEQ '1'
000661250617     C                     ITER
000662250617  E--C                     ENDIF
000663250617     C                     SETON                     99
000664250617     C                     LEAVE
000665250617 E---C                     ENDIF
000666250617E____C                     ENDDO
000667250617     C*
000668250617I----C           VAKAZU    IFGE 2
000669250617     C           VAKAZU    ANDLE10
000670250617     C           XXD01     CAT  VAMOJI:2  XXD01
000671250617E----C                     ENDIF
000672250617I----C           VAKAZU    IFEQ 1
000673250617     C                     MOVEL' A'      EIMOJI
000674250617     C           XXD01     CAT  EIMOJI:2  XXD01
000675250617E----C                     ENDIF
000676250617I----C           VAKAZU    IFEQ 11
000677250617     C                     MOVEL' J'      EIMOJI
000678250617     C           XXD01     CAT  EIMOJI:2  XXD01
000679250617E----C                     ENDIF
000680250617I----C           VAKAZU    IFEQ 12
000681250617     C                     MOVEL' Q'      EIMOJI
000682250617     C           XXD01     CAT  EIMOJI:2  XXD01
000683250617E----C                     ENDIF
000684250617I----C           VAKAZU    IFEQ 0
000685250617     C                     MOVEL' K'      EIMOJI
000686250617     C           XXD01     CAT  EIMOJI:2  XXD01
000687250617E----C                     ENDIF
000688250617     C*
000689250617     C*
000690250617     C*
000691250617     C*                                            持ち札カウント
000692250617I----C           VAKAZU    IFGE 2
000693250617     C           VAKAZU    ANDLE10
000694250617     C                     ADD  VAKAZU    DLRCRD
000695250617E----C                     ENDIF
000696250617I----C           VAKAZU    IFEQ 0
000697250617     C           VAKAZU    ORGE 11
000698250617     C                     ADD  10        DLRCRD
000699250617E----C                     ENDIF
000700250617I----C           VAKAZU    IFEQ 1
000701250617     C                     ADD  1         DLRCRD
000702250617     C                     ADD  10        DCEBOX
000703250617E----C                     ENDIF
000704250617     C                     ENDSR
000705250617     C*--------------------------------------------ジャッジ
000706250617     C*
000707250617     C*-----------------------------------------------------------------------
000708250617     C           JJJ1      BEGSR
000709250617     C*                                        ディーラーバーストあなたの勝ち
000710250617I----C           DLRCRD    IFGE 22
000711250617     C                     ADD  1         YOUPT
000712250617     C                     EXSR STRADD
000713250617     C                     MOVEL#MSG,4    RESULT
000714250617     C                     MOVEL#MSG,7    MSG01
000715250617E----C                     ENDIF
000716250617     C*                                              どちらも21で引き分け
000717250617I----C           DLRCRD    IFEQ 21
000718250617 I---C           YOUCRD    IFEQ 21
000719250617     C                     MOVEL#MSG,6    RESULT
000720250617     C                     MOVEL#MSG,8    MSG01
000721250617     C*                                                あなたの負け
000722250617 +---C                     ELSE
000723250617     C                     ADD  1         DLRPT
000724250617     C                     EXSR STRADD
000725250617     C                     MOVEL#MSG,5    RESULT
000726250617     C                     MOVEL#MSG,8    MSG01
000727250617 E---C                     ENDIF
000728250617E----C                     ENDIF
000729250617     C*
000730250617I----C           DLRCRD    IFLE 21
000731250617     C*                                                      引き分け
000732250617 I---C           YOUCRD    IFEQ DLRCRD
000733250617     C                     MOVEL#MSG,6    RESULT
000734250617     C                     MOVEL#MSG,8    MSG01
000735250617 E---C                     ENDIF
000736250617     C*                                                      あなたの勝ち
000737250617 I---C           YOUCRD    IFGT DLRCRD
000738250617     C                     ADD  1         YOUPT
000739250617     C                     EXSR STRADD
000740250617     C                     MOVEL#MSG,4    RESULT
000741250617     C                     MOVEL#MSG,8    MSG01
000742250617 E---C                     ENDIF
000743250617     C*                                                  あなたの負け
000744250617 I---C           YOUCRD    IFLT DLRCRD
000745250617     C                     ADD  1         DLRPT
000746250617     C                     EXSR STRADD
000747250617     C                     MOVEL#MSG,5    RESULT
000748250617     C                     MOVEL#MSG,8    MSG01
000749250617 E---C                     ENDIF
000750250617     C*
000751250617E----C                     ENDIF
000752250617     C*
000753250617     C                     SETOF                     92
000754250617     C                     SETON                     95
000755250617     C                     ENDSR
000756250617     C*---------------------------------------------------ゲームセット
000757250617     C*
000758250617     C*-----------------------------------------------------------------------
000759250617     C           GAMEST    BEGSR
000760250617     C*
000761250617I----C           YOUPT     IFEQ 3
000762250617     C                     MOVEL#MSG,4    RESULT
000763250617     C                     MOVEL#MSG,10   MSG01
000764250617     C                     WRITEDSP00
000765250617     C                     WRITEDSP99
000766250617     C                     EXFMTDSP03
000767250617E----C                     ENDIF
000768250617     C*
000769250617I----C           DLRPT     IFEQ 3
000770250617     C                     MOVEL#MSG,5    RESULT
000771250617     C                     MOVEL#MSG,11   MSG01
000772250617     C                     WRITEDSP00
000773250617     C                     WRITEDSP99
000774250617     C                     EXFMTDSP03
000775250617E----C                     ENDIF
000776250617     C                     ENDSR
000777250617     C*-------------------------------------------------------------------------
000778250617** #MSG
000779250617ゲームを始めましょう！（CTRLでディーラーがカードを配ります)
000780250617　　　・勝負に出る（F8）　   ・もう一枚カードを引く（CTRL）
000781250617 あなたのカードが21を超えてしまいました。
000782250617  YOU WIN!!
000783250617  YOU LOSE...
000784250617引き分け
000785250617ディーラーのカードが21を超えました。
000786250617
000787250617 勝負！！！
000788250617 おめでとう！あなたはゲームに勝利しました。
000789250617 残念！あなたはゲームに負けました。
000790250617
