000100250617                                            DSPSIZ(24 80 *DS3)
000101250617                                            CF03
000102250617                                            CF05
000103250617                                            CF08
000104250617
000105250617     A          R DSP00
000106250617      *                                     OVERLAY
000107250617
000108250617                                        2 25'       =========='
000109250617                                        3 25'       |=〇〇=|'
000110250617                                        4 25'       |   __   |        '
000111250617                                        5 25'       |        |         '
000112250617                                        6 25'     ---------------      '
000113250617                                        7 25'    /     |><|      |   '
000114250617                                        8 25'   /  /|         |  |   '
000115250617                                        9 25'  /  / |         |  |    '
000116250617                                       10 25'  |  | |         |  |      '
000117250617                                       11 25'  |  | |         |  |       '
000118250617                                       12 01'-----------------------------------
000119250617                                            ------------------------------------
000120250617                                            -----------'
000121250617
000122250617     A          R DSP01
000123250617                                            OVERLAY
000124250617                                       14 26'----------------------'
000125250617                                            COLOR(WHT)
000126250617                                       15 26'BLACK JACK  GAME  !!!!'
000127250617                                            COLOR(WHT)
000128250617                                       16 26'----------------------'
000129250617                                            COLOR(WHT)
000130250617                                       19 26'ゲームスタート(CTRL)'
000131250617                                       21 26'遊び方　　　   (F5)'
000132250617
000133250617     A          R DSP02
000134250617                                            OVERLAY
000135250617                                       14 12'カードを引いて21点を目指そう！'
000136250617                                            COLOR(WHT)
000137250617                                       16 12'21点を超えるとバーストして負けて-
000138250617                                            しまいます。　'
000139250617                                            COLOR(WHT)
000140250617                                       18 12'Ｊ，Ｑ、Ｋは10点、'
000141250617                                            COLOR(WHT)
000142250617                                       19 12'Ａは1点、もしくは11点のどち-
000143250617                                            らかとして手札に加えられます。'
000144250617                                            COLOR(WHT)
000145250617                                       21 12'3回勝てばゲーム-
000146250617                                            クリアです。'
000147250617                                            COLOR(WHT)
000148250617
000149250617
000150250617
000151250617     A          R DSP03
000152250617                                            OVERLAY
000153250617      *        　BCDBC         2  0B 13 50              デバック用
000154250617                  YOUSTR         8     13 72
000155250617                                       13 61'あなた'
000156250617                  DLRSTR         8     14 72
000157250617                                       14 61'ディーラ'
000158250617                  XXP01         48     21 20
000159250617                  XXD01         48     16 20
000160250617      *           HHHHHH         2     13 10
000161250617      *           HHHHH2         2     14 10
000162250617
000163250617
000164250617                  RESULT        24     18 29
000165250617                                            COLOR(WHT)
000166250617
000167250617                R DSP90
000168250617                                       19 25'GAME OVER               !'
000169250617                R DSP99
000170250617                                            OVERLAY
000171250617                  MSG01         78     24  2
000172250617                                            COLOR(WHT)
000173250617
